; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p10---int100n150-m25---int100c150---s354---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level15 level15)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level15 level16)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level15 level17)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level15 level18)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level15 level19)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level15 level20)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level15 level21)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level15 level22)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level15 level23)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level15 level24)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level15 level25)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level15 level26)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level15 level27)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level15 level28)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level15 level29)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level15 level30)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level15 level31)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level15 level32)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level15 level33)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level15 level34)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level15 level35)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level15 level36)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level15 level37)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level15 level38)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level15 level39)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level15 level40)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level15 level41)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level15 level42)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level15 level43)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level15 level44)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level15 level45)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level15 level46)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level9 level44)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level9 level45)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level9 level46)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level43 level2 level45)
(sum level44 level2 level46)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l3)
(fuelcost level12 l0 l3)
(connected l0 l4)
(fuelcost level2 l0 l4)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l3)
(fuelcost level2 l1 l3)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l3 l0)
(fuelcost level12 l3 l0)
(connected l3 l1)
(fuelcost level2 l3 l1)
(connected l3 l2)
(fuelcost level4 l3 l2)
(connected l3 l4)
(fuelcost level15 l3 l4)
(connected l4 l0)
(fuelcost level2 l4 l0)
(connected l4 l3)
(fuelcost level15 l4 l3)

(at t0 l0)
(fuel t0 level46)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l3)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l3)
(at p7 l0)
(at p8 l2)
(at p9 l2)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l4)
(at p3 l3)
(at p4 l3)
(at p5 l4)
(at p6 l1)
(at p7 l2)
(at p8 l4)
(at p9 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 10
2. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 10
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 10
4. (drive t0 l0 l3 level34 level12 level46)
   deleted: (at t0 l0) (fuel t0 level46)
   added: (at t0 l3) (fuel t0 level34)
   goals met: 0 of 10
5. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 1 of 10
6. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 1 of 10
7. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 1 of 10
8. (drive t0 l3 l2 level30 level4 level34)
   deleted: (at t0 l3) (fuel t0 level34)
   added: (at t0 l2) (fuel t0 level30)
   goals met: 1 of 10
9. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 2 of 10
10. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 10
11. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 3 of 10
12. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 3 of 10
13. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 3 of 10
14. (drive t0 l2 l1 level25 level5 level30)
   deleted: (at t0 l2) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level25)
   goals met: 3 of 10
15. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 3 of 10
16. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 3 of 10
17. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 4 of 10
18. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 5 of 10
19. (drive t0 l1 l3 level23 level2 level25)
   deleted: (at t0 l1) (fuel t0 level25)
   added: (at t0 l3) (fuel t0 level23)
   goals met: 5 of 10
20. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 6 of 10
21. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 7 of 10
22. (drive t0 l3 l4 level8 level15 level23)
   deleted: (at t0 l3) (fuel t0 level23)
   added: (at t0 l4) (fuel t0 level8)
   goals met: 7 of 10
23. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 8 of 10
24. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 9 of 10
25. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 10 of 10
